pascal-4.0/tutorialsOld/surfaceTracking/interTrackMHDFoam/tank3D_FL/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phase1
{
    transportModel Newtonian;
    nu             nu  [ 0 2 -1 0 0 0 0 ] 1e-04;
    rho            rho [ 1 -3 0 0 0 0 0 ] 100;
}

phase2
{
    transportModel Newtonian;
    nu             nu  [ 0 2 -1 0 0 0 0 ] 0;
    rho            rho [ 1 -3 0 0 0 0 0 ] 0;
}

sigma sigma [ 1 0 -2 0 0 0 0 ] 0;

surfactantProperties
{
    bulkConc            bulkConc            [ 0 -3  0 0  1 0 0 ] 1.0e-2;

    saturatedConc       saturatedSurfConc   [ 0 -2  0 0  1 0 0 ] 5.0e-6;

    adsorptionCoeff     adsorptionCoeff     [ 0  3 -1 0 -1 0 0 ] 40.0;

    desorptionCoeff     desorptionCoeff     [ 0 -3  0 0  1 0 0 ] 8.93e-2;

    bulkDiffusion       bulkDiffusion       [ 0  2 -1 0  0 0 0 ] 1.0e-9;

    diffusion           diffusion           [ 0  2 -1 0  0 0 0 ] 1.0e-9;

    temperature         temperature         [ 0  0  0 1  0 0 0 ] 293.0;
}

// ************************************************************************* //
