pascal-4.0/tutorialsOld/surfaceTracking/interTrackMHDFoam/tank3D_FL/Allrun
#!/bin/sh

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Run
runApplication blockMesh
runApplication makeFaMesh
runApplication `getApplication`
